{
    "7XL3O6JUF0": {
        "progress_num": 0,
        "name": "00 楔子",
        "story": [
            "你可曾聽說過 DejaVu？也就是所謂的既視感，面對初次接觸的事物，卻彷彿曾經經歷過。你也有過這樣的經驗嗎？人們都說：每天都是新的一天！所有事物都是新的，要用迎接新事物的心來面對每一天！既然如此，那些總是忽然出現、又如同黏膩的迷霧般纏繞在腦海中的既視感又是怎麼一回事呢？"
        ],
        "next": ["/"]
    },
    "EHEHZ7UDVR": {
        "progress_num": 1,
        "name": "01 新的一天",
        "story": [
            "「嗶嗶嗶——嗶嗶嗶——」方璇抖動了一下，翻過身來，睡眼惺忪地按掉鬧鐘後，又閉目養神了幾秒。「唉⋯⋯不行，今天的課說要點名，不能再翹了。」方璇閉著眼睛對自己說道。說完，便掙扎著爬起身，開始梳洗準備去上課。方璇站在鏡子前閉著眼睛正準備要刷牙，半睡半醒中，不小心把洗面乳當成牙膏擠在牙刷上。「哎唷！白癡喔？我⋯⋯咦？」正懊惱時，方璇的心裡忽然升起一股異樣——", "「總覺得⋯⋯好像也發生過同樣的事⋯⋯」「早⋯⋯」正狐疑時，室友睡眼惺忪地從門口走進來，邊打哈欠邊向著方璇打招呼。「喔、早阿。」方璇簡單的回應了室友，心想「應該只是還沒睡醒的關係吧。」沒有繼續糾結，快速整理完畢後便匆忙前往教室上課了。"
        ],
        "next": ["/pascal"]
    },
    "A9HZFE3DJL": {
        "progress_num": 2,
        "name": "02 遞迴",
        "story": [
            "課堂中一片寂靜，只有(副)教授在講台上打字的聲音，(副)教授的手指動的飛快，投影幕上的程式碼也飛速的增加，沒幾分鐘，「啪！」的一聲，(副)教授按下了 Enter 鍵，掃視了一下程式碼，拿起了麥克風——「各位同學，今天要來介紹一個概念，叫做遞迴。什麼叫遞迴？遞迴就是，當你今天要做的工作很複雜，重複性高，但不知道要做幾次，你就叫一個人來，說：欸！這個工作給你，我做了一次，", "剩下你看著辦，我只知道做到怎樣要停止而已，剩下我不知道！然後你叫的那個人也跟你做一樣的事：再叫一個人來，繼續把工作往下派，直到有一個人拿到工作的時候發現：嘿！工作已經完成了欸！然後就往回傳說：工作完成了，這就是結果，一路往回傳，傳到你的手上，這樣就完成了那個工作。而這樣不斷的找人來做的概念，就叫做遞迴。」如同(副)教授寫程式一樣，解釋起來也是連珠炮般的語速，在學生", "眼裡螢幕上的程式碼彷彿是催眠咒，而(副)教授的解釋是搖籃曲，沒多久就有許多人陣亡了，但(副)教授絲毫不在意，繼續介紹道：「而遞迴在程式碼裡的實現，就是函數要自己呼叫自己，不論是直接還是間接，總是會呼叫到自己，我們這裡是直接呼叫，看一下程式碼第 12 行，呼叫函數的地方，這時候程式在這一層會先停在這裡，等待下面呼叫的函數結束之後回傳結果。」", "「怎麼感覺⋯⋯老師好像講過這個了⋯⋯」方璇終於也撐不住，趴倒在桌上。"
        ],
        "next": ["/after-class"]
    },
    "W40WTDR9G9": {
        "progress_num": 3,
        "name": "03 有趣的玩意",
        "story": [
            "「嘿！你來啦～今天找到了有趣的玩意喔！」方璇剛踏入社辦，社長鄭烈便用充滿興奮的語氣向著方璇打招呼。「來，你看這個——」鄭烈帶著方璇走向社辦中央的大桌子，桌上放著一個看似水晶的石頭，而副社長邢泰正看著一名頂著鍋蓋頭、臉上掛著圓框眼鏡的社員，輕巧的用工具試圖分解石頭。「你們又去翻垃圾場了喔?」方璇一邊放下書包，一邊仔細端詳桌上的奇特物品。", "「拜託我們可是神秘科學研究社欸，當然要做一些神祕的事啊～」鄭烈嘻皮笑臉的說，沒等方璇翻完白眼，鄭烈馬上接著說：「先別管這個了，你仔細看這個石頭裡，是不是有個片狀的東西？」「好像是欸，知道這是什麼嗎？」方璇拿起石頭仔細看著裡面，疑惑的詢問。「現在還不知道，但等一下就不好說了。」鄭烈一邊說著一邊翻找著工具箱。「什麼意思⋯⋯？」方璇正說著，一回頭就看到鄭烈拿了", "一把榔頭就朝桌上的石頭砸去。「哐啷」一聲，隨著沉重的聲響，石頭碎成了好幾塊。從石頭中掉出來一片晶片。「他媽的鄭烈你在幹三小！把裡面的東西砸壞怎麼辦？」被鄭烈突如其來的舉動嚇到，邢泰激動的大叫。「哎呀，沒事就好嘛沒事就好。」鄭烈依舊嘻皮笑臉的說，一邊把榔頭放回工具箱，一邊拍了拍手上的灰塵。「這是...晶片吧?」沒有理會社長和副社長的喧鬧，鍾瑞基用鑷子拿起桌上的", "晶片起來仔細端詳。「我們是不是有讀這種晶片的裝置啊?」方璇似乎對這種晶片有點印象。「喔上次桌遊社說他們要設計 ARG 實境解謎關卡，把它借走了，要用的話應該可以直接去他們社辦。」魏元祖拔下了耳機，畫面上還顯示著崩壞：星穹鐵道的遊戲畫面。"
        ],
        "next": ["/hex"]
    },
    "TVUC2WW5E7": {
        "progress_num": 4,
        "name": "04 Hex",
        "story": [
            "眾人帶著晶片來到桌遊社後，方璇把晶片放入讀取裝置。只見一道刺眼的白光從顯示器上閃過，伴隨著尖銳的耳鳴，頃刻間，彷彿世界凝結了一般，連空氣也靜止了。數秒鐘過去，世界像一台被修好的時鐘，一切終於又開始轉動。大家並沒有察覺到剛才那一瞬間發生的事，唯獨方璇注意到有什麼地方不太尋常。「欸欸！你們看！這些亂碼是什麼啊？」魏元祖指著螢幕，畫面上充滿著英文與數字的排列，它們", "單獨拆開來看都看得懂，但組合在一起卻如同成了上古文明的文字。「這個亂碼……看起來有點像副檔名錯誤，導致讀取的程式用錯誤的編碼開啟，它會不會原本不是這個格式的檔案？」「那我試試看改副檔名好了。」魏元祖嘗試更改了副檔名。「沒用欸——」看著文字編輯器上依舊是一片亂碼，鍾瑞基說道。「哎呀不要瞎猜了，這是由 HEX 組成的密文啦！所謂的 HEX 呢就是 16 進制的編碼，最常見的應用", "是在色碼⋯⋯」鍾瑞基向大家解釋著，但其他人似乎也已經習慣了他的喋喋不休。「說那麼多不如直接解碼。」邢泰毫不留情的打斷鍾瑞基說道。魏元祖迅速的打開線上解碼器，並將剛才開啟的 HEX 文字貼上，按下 Decode 按鈕的同時喊著不標準的日文：「已哭已哭！」"
        ],
        "next": ["/goto"]
    },
    "53XNO7H9UQ": {
        "progress_num": 5,
        "name": "05 躊躇",
        "story": [
            "將亂碼解讀出來後，眾人發現這是一組座標，於是把座標輸入 Google 地圖後，便循著導航過去，直到距離目的地兩百公尺處，邢泰警戒的停了下來——「不對勁。」邢泰說道「先等一下。」並拉住了神經大條、仍兀自往前走的鄭烈。「前面好黑⋯⋯」鍾瑞基恐懼的看著眼前深不見底的黑暗，彷彿那裡有著某種吞噬萬物的巨獸，而這片黑暗則是牠的血盆大口。儘管是心寬體胖的魏元祖，在這樣的黑暗", "面前，也不得不停下腳步。眾人止步於此，心中冒出來的都是同一個念頭——「現在該怎麼辦?」「偉哉我綠色大學，居然連這種電也要省。只不過是沒開燈而已對吧？」神經大條的鄭烈仍用著歡快的口氣緩和氣氛，替大家壯膽。好奇心驅使著方璇，見沒有人前進，便打開手機的手電筒往前照，沒想到光線竟無法穿透黑暗。副社長邢泰見狀，則隨地撿起一顆石頭丟向深淵，石頭卻也如同墜落在棉花海中，", "一點聲響都沒有。如此詭異的情況讓眾人更加躊躇。"
        ],
        "next": ["09BNNZ7I3K", "5FWBD037V7"]
    },
    "09BNNZ7I3K": {
        "progress_num": 5.1,
        "name": "5-1 打道回府",
        "story": [
            "正當方璇鼓起勇氣準備向前跨步時，魏元祖突然開口——「我⋯⋯我的野性直覺告訴我，這前面有著相當危險的存在，我的全視之眼在這黑暗中看見了深淵，而當你凝視著深淵時——」「深淵也凝視著你⋯⋯」鍾瑞基接了下去。經過魏元祖這麼一說，眾人再轉頭望向那黑色巨口時，那裡彷彿傳出了一陣陣寒風的低鳴，如同奏響名為死亡的賦格。「回去吧。」邢泰拍了拍方璇的肩膀「我難得認同元祖的", "看法。」「竟然連邢泰都這麼說了——」鄭烈略帶失望的說道：「看來這次確實應該選擇回頭呢⋯⋯」「好吧，既然大家都這麼說了。」於是乎，方璇收回了準備跨出的腳步，眾人便就此原地折返，向著學活的方向前進。「欸今天學校全家霜淇淋有優惠買一送一欸！」經過圖書館前時魏元祖看著手機大喊。「真假！什麼口味什麼口味？」鍾瑞基興奮的湊了上去。「呵呵，瑞基啊，你不看看現在是什麼月份，", "現在可是二月啊，說到二月的節日，那不就是⋯⋯.」「哎呀！」鍾瑞基一拍自己額頭「我竟然給忘了，肯定是草莓了——」「什麼？草莓！」一聽見關鍵字，走在較前面的方璇立刻興奮地湊了上來：「我喜歡草莓！」「那方璇你要跟誰分？」鍾瑞基問道。「我可以跟元祖分啊！」方璇理所當然地回答。‌「喔好啊啊啊啊痛痛痛⋯⋯」魏元祖正要順口答應，就被鍾瑞基捏了一下肚子的肥肉。「你幹嘛啦！」魏元祖", "轉頭跟鍾瑞基小聲說到。「你不會讀空氣喔？」鍾瑞基用氣音罵道，並用眼神指了指方璇跟社長鄭烈。「啊⋯⋯另一個口味是北海道鮮乳欸，抱歉了方璇，我想自己吃兩支。」就算是活在二次元的魏元祖，也是稍微懂得三次元的閱讀空氣，因此他馬上意會到了瑞基的暗示。「蛤啊！那瑞基⋯⋯？」方旋轉頭便問了一旁的鍾瑞基。「瑞基跟我分。」邢泰忽然插話，嘴角的笑意藏不住。鍾瑞基對邢泰伸出他長長的", "大拇指，露出的上排牙齒在路燈的照射下閃閃發光，像是一串寫著「Nice Bro」的摩斯密碼。邢泰也捶捶胸膛，並指向鍾瑞基:「I got you」。「方璇，你跟我一起吧！」鄭烈似乎語帶雙關地說道。「喔好啊！」方璇爽快的答應，但她似乎沒有意會到另一層意思，只是雀躍的走向便利商店：「好耶！冰淇淋！」於是一眾社員今日的探險便在便利商店前結束了，伴隨著甜香冰涼的霜淇淋在口中融化，對於先前那些", "神秘事件的記憶也逐漸消失，就這樣，眾人的生活便回歸平凡，再也沒有人想起那神秘的石頭和晶片。"
        ],
        "ending": "結局 1 - 人生而平凡，你與他並沒有什麼不同，一生都是如此，直至終末",
        "next": ["5FWBD037V7"]
    },
    "5FWBD037V7": {
        "progress_num": 5.2,
        "name": "5-2 勇敢向前",
        "story": [
            "方璇一咬牙，鼓起勇氣朝著黑暗走去，方璇感覺到自己的身軀完全沒入黑暗，越往深處走，四周的空氣彷彿越來越濃稠，這讓方璇的腳步變得窒礙難行。忽然間，方璇好似碰到了一堵牆，一堵看不見的牆，使勁的往前推，牆體卻紋絲不動。「可惡，看來只能回去了」方璇自語道，順手槌了一下這道看不見的牆。正當方璇轉身要往回走時，卻聽見了社團成員的聲音。「喂！等等我們啊！」「上次你欠我的珍奶錢", "還沒給我欸。不可以啊！」「走啊打球啊幹嘛！」「你的步長是我的兩倍，也就是說我要以你兩倍的速度走路才能追上你。」「等⋯⋯等我一下⋯⋯」「你們也來了⋯⋯啊？」方才那堵牆忽然消失不見，而原本一手扶著牆的方璇，就這麼失去支撐，往後摔了出去。那一瞬間，他想起了幾年前在網路上走紅的迷因考古影片，那感覺就像是掉進後室一樣。剎那間，一陣酥麻的感覺從頭頂傳到腳尖。映入眼簾的除了", "圍繞在周遭的虛無之外，還有許多流光般的亮點在空中流淌著，它們像黑夜中的星點，忽明忽暗；又像水中的氣泡，緩緩流動著。這些閃爍的亮點有些凝聚成球狀，有些則呈柱狀，定睛一瞧，它們竟都是由 0 與 1 構成的。"
        ],
        "next": ["/goto"]
    },
    "UQNA4R9V6K": {
        "progress_num": 6,
        "name": "06 過去與未來",
        "story": [
            "方璇好奇的伸手觸摸一個發光柱體，一些不屬於他的記憶，夾帶著憤怒、悲傷、快樂、無奈等複雜的情緒灌入方璇的心中，儘管零碎但卻清晰無比。在那些記憶中，他能清楚看見，那是某個人的過去——一輛疾駛的大型客車、一名躺在病房中的男子，以及墓前放著的一束花朵。「李俊逸⋯⋯是誰？」一個陌生的名字浮現在方璇腦海，方璇的意識彷彿融進了那些混雜著強烈情緒的記憶中。片刻之後，方璇清醒過", "來，又觸摸了別的柱體，此刻，她居然能從第三人稱視角看見自己的身影，然後景物開始逐漸拉遠。直到他看見在一個球體中，猶如幻燈片的成像，那些在戰爭中流離失所的人們、在極寒中凍死的屍骨，甚至被海嘯淹沒的城市，許多人都被困在這個球體中，無法逃脫。像無限熵增的宇宙，視點還在不停的膨脹，直到最後，變成一片虛無，那裡什麼都沒有，似乎連光都不復存在。回過神來，方璇驚覺自己的眼淚", "如洩洪般湧出，他意識到自己剛才看到的那些，是未來發生的事情，天災人禍將這個世界推向慘絕人寰的毀滅，而自己和摯愛的家人朋友，也在各種各樣的災難中飽受煎熬。這時，方璇突然感覺到一股強大的拉力，將他拉回了黑暗空間，回頭一看，竟是一個身穿黑色斗篷的神秘身影。「你是誰？」方璇吃了一驚，立刻退開兩步、對著神祕身影喊到。神秘人沒有說話，只是緩緩伸出手往方璇的胸前虛抓了", "一下，霎時間方璇便感覺自己動彈不得。「發生了什麼事？他剛才明明沒有碰到我——」方璇心裡暗暗驚呼，兩眼驚恐地看著神秘人，又感覺自己的身體慢慢飄浮起來。神秘人又將另一支手舉至胸前，空中便有光點往神秘人的手中聚集，就這麼一握，那些光點便形成了一支權杖。神秘人用權杖在方璇的額頭前一點，方璇便感覺自己的意識彷彿被丟入了萬丈深淵，四周開始變得黑暗，逐漸失去知覺。在完全失去", "意識前，只聽見神秘人嘴上低語著——「——第 19970927 號異常捕獲，原因不明，回溯狀態，重試次數加一」"
        ],
        "next": ["/loop"]
    },
    "IQA8CDKKHU": {
        "progress_num": 7,
        "name": "07 新的一天?",
        "story": [
            "「嗶嗶嗶——嗶嗶嗶——」方璇抖動了一下，翻過身來，睡眼惺忪地按掉鬧鐘後，又閉目養神了幾秒。「唉⋯⋯不行，今天的課說要點名，不能再翹了。」方璇閉著眼睛對自己說道。說完，便掙扎著爬起身，開始梳洗準備去上課。方璇站在鏡子前閉著眼睛正準備要刷牙，半睡半醒中，不小心把洗面乳當成牙膏擠在牙刷上。「哎唷！白癡喔？我⋯⋯咦？」正懊惱時，方璇的心裡忽然升起一股異樣——", "「總覺得⋯⋯好像也發生過同樣的事⋯⋯」「早⋯⋯」正狐疑時，室友睡眼惺忪地從門口走進來，邊打哈欠邊向著方璇打招呼。「喔、早阿。」方璇簡單的回應了室友，心想「應該只是還沒睡醒的關係吧。」沒有繼續糾結，快速整理完畢後便匆忙前往教室上課了。"
        ],
        "next": ["/weird"]
    },
    "3OU6TWYBPZ": {
        "progress_num": 8,
        "name": "08 遞迴",
        "story": [
            "課堂中一片寂靜，只有(副)教授在講台上打字的聲音，(副)教授的手指動的飛快，投影幕上的程式碼也飛速的增加，沒幾分鐘，「啪！」的一聲，(副)教授按下了 Enter 鍵，掃視了一下程式碼，拿起了麥克風——「各位同學，今天要來介紹一個概念，叫做遞迴。什麼叫遞迴？遞迴就是，當你今天要做的工作很複雜，重複性高，但不知道要做幾次，你就叫一個人來，說：欸！這個工作給你，我做了一次，", "剩下你看著辦，我只知道做到怎樣要停止而已，剩下我不知道！然後你叫的那個人也跟你做一樣的事：再叫一個人來，繼續把工作往下派，直到有一個人拿到工作的時候發現：嘿！工作已經完成了欸！然後就往回傳說：工作完成了，這就是結果，一路往回傳，傳到你的手上，這樣就完成了那個工作。而這樣不斷的找人來做的概念，就叫做遞迴。」如同(副)教授寫程式一樣，解釋起來也是連珠炮般的語速，在學生", "眼裡螢幕上的程式碼彷彿是催眠咒，而(副)教授的解釋是搖籃曲，沒多久就有許多人陣亡了，但(副)教授絲毫不在意，繼續介紹道：「而遞迴在程式碼裡的實現——」「怎麼感覺⋯⋯老師好像講過這個了⋯⋯」方璇終於也撐不住，趴倒在桌上。「不對！老師真的教過了！」方璇正準備進入夢鄉時，心裡突然大驚，突然坐起身跟旁邊的室友說道。「哎唷你白癡喔這個老師才第一次講，頭都快痛死了你還教過", "咧⋯⋯」一旁的室友頭也沒回，拼命地敲打鍵盤，努力的要把投影幕上的程式碼全抄下來。儘管室友斬釘截鐵地說老師第一次教，方璇依舊對眼前的景象有深刻的記憶。「不論是直接還是間接⋯⋯」老師說，「總是會呼叫到自己⋯⋯」方璇接了下去。「⋯⋯程式碼第 12 行，呼叫函數的地方⋯⋯」老師在台上說道「⋯⋯程式碼第 12 行，呼叫函數的地方⋯⋯」方璇在台下同時脫口而出。方璇和老師異口同聲", "的說出了講課的內容，更加確信了自己聽過這堂課，這下睡意全消，不禁開始思考這究竟是怎麼一回事。"
        ],
        "next": ["/graduate/sign"]
    },
    "E6AHK4P564": {
        "progress_num": 9,
        "name": "09 虛擬中的現實",
        "story": [
            "方璇再次衝進黑暗，這次，他已經知道了神秘人會出現，便做好了應對神秘人的準備，手上抓著隨手撿來的木棍，準備隨時迎擊。果不其然，神秘人真的憑空出現在他的面前，這讓方璇吃了一驚，但也立刻橫掃揮出手上的木棍，神秘人被擊中後退了兩步，方璇則趁機拉開與神秘人的距離。「咦？看你的反應，似乎早就知道我會來了，你竟然能夠記得之前發生過的事情嗎？」神秘人似是向方璇提出詢問，又像", "是自言自語一樣低聲道。「這些一直重複發生的事情都是你搞出來的嗎？」方璇質問著神秘人。「是，但也不算是——」神秘人嘆了口氣，拂了拂長袍下擺上的塵土，正是剛才被木棍擊中的地方。「這是什麼意思？」方璇依然保持著警戒。神秘人絲毫沒有理會方璇的質問，便伸出手，用食指在空中比劃，快速的寫下一些看不見的文字後，一道門出現在面前，神秘人抓起門把、推開，接著回頭一瞥：「跟我來", "吧。」門後，是一處像是辦公室的地方，一套辦公桌椅被安放在中央，一旁的矮桌則被各式各樣的文件掩埋，整個空間顯得雜亂無章。神秘人將矮桌上的文件稍做整理，又用手比了比矮桌旁的位子，示意方璇坐下，隨後便轉身去泡了壺伊達邵買的蜜香紅茶並坐下來為方璇和自己各斟了一杯。「——這個世界就是一支大型的程式，不斷重複模擬著人類文明的結局，透過遞迴的概念，模擬著世界各種不同的選擇⋯⋯", "知道什麼是遞迴嗎？」神秘人說到這裡，停頓了一下，拿起茶杯啜飲的同時，看向一臉茫然的方璇，方璇點了點頭，又搖了搖頭，一副欲言又止的模樣。「我的工作是負責呼叫下一次遞迴，生成下一個節點，而你⋯⋯不過是世界運行的其中一個物件罷了。」神秘人隨手拿起文件堆中的一張紙，簡單的瀏覽一下後又隨意的扔在地上。「先等一下！」方璇一手按著太陽穴，一手舉起，打斷了神秘人。「這裡", "是哪裡？從剛才到現在發生的這些到底是怎麼回事，我看見的那些⋯⋯是幻覺嗎？」方璇對於眼下發生的事情一頭霧水。「這麼說吧——這裡是被稱為『Call Stack』的地方，在此之前，你所看到的那些光點是記憶體的片段，而那個地方則是記憶體之外了。」神秘人看了方璇的反應後繼續說：「被程式碼構建出來的你能夠進到那裡，是由於溢位錯誤造成的結果。而你在那裡所看見的並不是幻象，他們全都是", "真實的過去和未來，只是那是在不同節點發生的事情。」神秘人向方璇解釋著來龍去脈。「什麼 Call Stack、溢位、節點的，我實在聽不懂⋯⋯」方璇努力的嘗試理解神秘人所說的一切，但無奈他只是一個外系的學生，在此方面也沒什麼天賦，上程設課時又總愛睡覺，目前為止程式相關的課程根本沒有打好基礎。神秘人沒有回答，只是靜靜地品著茶。「你剛才說，我所看到的過去和未來都是真實的，難道世界", "的結局一定是那樣悲慘的嗎？」方璇不自覺地提高了音量。神秘人只是沉默的看著杯中的液體，眉頭深鎖，若有所思的樣子。「難道你不能做點什麼嗎？改變什麼變數之類的？」方璇激動的問道。「不，我不能，我們都不能，我們只能按照被定義好的條件設定相應的變數，然後在這裡等待結果。」神秘人又替自己倒了一杯熱茶，表情和杯中的水面一樣平靜。「你又如何知道一定會失敗呢？也許會有一千四百多", "萬分之一的機率成功啊！」方璇不想放棄那任何一點微小的機會，那怕只有一丁點。「孩子⋯⋯」神秘人放下手中的熱茶，杯中揚起一道漣漪，他往前挪了挪身子，沉著臉，凝視著眼前迷惘的個體。「這個世界所模擬的，不是結局的好與壞——」神秘人審視般的眼神盯得方璇直發寒，定睛一看，瞳孔裡好似裝了一整個宇宙，彷彿曾經親眼見證千百萬個平行世界那般，既深邃、美麗，又讓人心生畏懼。", "「——而是在注定的結局下，能有幾種引致毀滅的方式。」"
        ],
        "next": ["/doom"]
    },
    "L2QCUO6LHI": {
        "progress_num": 10,
        "name": "10 命定",
        "story": [
            "「難道我們注定毀滅嗎？」方璇絕望地說。「對於這個世界來說，我們的存在過於渺小，不足以撼動這個世界的走向，即使模擬了成千上萬次，你我依然只是這個世界眾多元件裡的其中一個；即使不斷的呼叫遞迴模擬不同的可能，也依舊跳脫不出我們所在的這個節點。」「等等⋯⋯『這個節點』？你的意思是，還有別的節點？」「是的，遞迴會不斷產生新的節點，而我們這個節點在執行之初所收到的條件", "參數，是在一次大事件之後繼續模擬。該事件擁有關鍵性的分歧點，從這個分歧點衍伸出了 3 個分支，我們所在的節點正是那三個分支當中通往最壞結局的那一個。」「難道你就不會覺得害怕、覺得不公平嗎？」「覺得恐懼、覺得絕望、覺得不公，又有何用呢？每段命運都會駛向必然的終點，這點無論是人類，抑或是這個世界都是如此，差別只在於途中經過了什麼地方罷了。」神秘人搖了搖頭。「好了⋯⋯", "差不多也該請你回去了。」神秘人緩緩起身，接著再次「拿」出了權杖，用同樣的方式將方璇丟入深淵。「——第 19990617 號異常捕獲，原因不明，回溯狀態，重試次數加一——」"
        ],
        "next": ["/book"]
    },
    "3GXPGI1JYA": {
        "progress_num": 11,
        "name": "11 幫手",
        "story": [
            "「嗶嗶——」方璇抖動了一下，翻過身來，以迅雷不及掩耳的速度按掉鬧鐘。這一次，她已經決定好要怎麼做了。她急匆匆的衝進教室，絲毫不管自己提早了至少十分鐘進到教室，此時在教室內的還只有助教。「同、同學⋯⋯怎麼了嗎？」見方璇披頭散髮的狼狽模樣，這讓原本正在架設上課環境的助教連忙放下手邊的事情上前關心。「助教，我有問題想問你⋯⋯遞迴的過程中，要怎麼跳到其他節點？」", "還氣喘吁吁的方璇一上來就拋出了刁鑽的問題，這讓助教很是錯愕。「呃⋯⋯應該沒辦法，除非程式在一開始就有寫能跳到其他節點的指令，否則一旦程式運行後，就不能再修改。」面對如此唐突的問題，讓助教覺得自己大概是遇上怪人了，但他依舊冷靜的解釋著。聽見這個消息的方璇猶如天打雷劈，方才與神秘人對談時湧現的絕望感似乎加重了不少。「不過，想讓程式跳到其他的節點，也不是完全不可能，", "之前就有個學長用外部的程式進到記憶體裡，直接修改原本程式內的變數，來改變運行的步驟和結果。」「畢竟程式本身只知道運行到程式碼的哪一行，並不知道當前的運行狀態和內容是什麼。打個比方好了：假設今天你在工廠打工，你的工作是盯著廠裡的機器有沒有正常運作，品管、材料進貨跟包裝，那些事情都與你無關，因為有其他部門的人會管。」「具體來說，應該要怎麼做？」助教拿出手機，在", "上面瘋狂的敲擊著。而方璇馬上收到了幾則夾帶網址的訊息。「這是那個學長的 GitHub 連結，還有論文電子全文，你有興趣的話就拿去看吧！」方璇現在一心只想得到解決問題的方法，儘管那有可能是一堵高牆。在她打開連結的那一刻，標題大大的寫著『 OS Level 的資安防護，透過攻擊記憶體操控程式運行，以 C++ 實作為例』。看著密密麻麻的程式碼和學術專有名詞，方璇頓時覺得頭昏眼花。助教所", "講的道理他自然是懂的，但實際要怎麼做卻讓她覺得毫無頭緒，於是方璇決定另闢蹊徑——「那個⋯⋯助教！我有事情想拜託你，下課之後能不能來神科研的社辦一趟？」"
        ],
        "next": ["/goto"]
    },
    "SCM0QA7AXA": {
        "progress_num": 12,
        "name": "12 寧靜",
        "story": [
            "「喲喲！這不是我們神科研的總・務・大・人嗎？這麼早來社辦，今天是什麼大好日子？」鄭烈剛帶著社員們進入社辦，就發現平常總是最晚到的方璇已經在社辦中。「這你男朋友喔？」鄭烈看向方璇身旁的陌生男子，語帶嬉鬧的說道。「對阿，今天帶來介紹給大家認識。」方璇毫不猶豫的信口雌黃。「蛤阿！真的假的！」鄭烈的語氣明顯透出一股失落。「有時候，我真的覺得你是個小學生。」邢泰拍了拍", "鄭烈的肩膀說。「啊哈哈⋯⋯沒有啦！這位是我修的程設課的助教 - 韓術學長。」方璇在集合了神科研的大夥後，向大家介紹了剛被邀請來的助教。「大家好，我是韓術。」韓術略顯害羞地向大家打了招呼。「你好！歡迎你來到神科研！我是社長——鄭烈。」社長鄭烈首先熱情的回應了韓術，並伸出了健壯的手，用力地和韓術握了握手。「跟你介紹一下其他人，這位是我們神科研的副社長——」鄭烈如同一名", "導遊，帶領著韓術認識社團內其他成員。「——邢泰。」副社長邢泰接著鄭烈的話，但本來話就不多的他也只吐出了自己的名字並點了點頭。「吾名曰魏元祖，聽聞汝為程設助教，若有幸能交流⋯⋯」魏元祖擺出了紅魔族特有的自我介紹姿勢，並用正常人不會使用的語法進行著自我介紹。「幹你北七喔不要在那邊耍中二了啦！」鍾瑞基直接打斷了魏元祖的介紹：「啊哈哈！你好我是鍾瑞基，你們課的老師很", "有名喔，我常聽說他的事蹟。」「我們老師是很有個性的老師。」韓術笑了笑，委婉的幫老師說了點好話：「但是我們老師的水準是無庸置疑的。」「好啦！大家交流先到這邊，我有很重要的事情要講。」方璇眼看社員和助教的交流逐漸熱絡起來，連忙打斷大家。「事情是這樣的——」方璇從早上起床的異樣感開始說起，再說到課堂上自己完全知道老師的課程內容。「——這些都是我經歷過三次這一天的", "證明。」具體來說是不是三次，方璇其實也不太清楚，有可能其實今天已經重複好幾千萬次，但她的記憶被抹去了也說不定。「這是那個吧！頭文字 D 的主題曲 DeJavu! I just be in this place before——」魏元祖順勢唱了起來，坐在椅子上一邊扭動身體，做出自己在甩尾的動作。「DeJavu，中文叫做既視感，是指人們對於自己未曾經歷過的事物有著異常的熟悉感，目前科學尚未完全了解此一現象的發生", "原因，但主流的說法是由於左右腦的訊息處理突然不協調所致。」鍾瑞基推了推眼鏡，開始滔滔不絕地解說起名詞。「好了！你先不要唱了。」鄭烈拍了拍還在扭動的魏元祖的肩膀請他安靜，接著對方璇提問：「你說的這兩件事確實是蠻奇怪的，但是就像瑞基說的，有沒有可能只是你自己的錯覺？」「哼哼⋯⋯ 我早就知道你們會是這個反應了，所以我刻意只說了前兩件事——」方璇雙手插腰，驕傲地", "笑了兩聲。「鄭烈，你的袋子裡放著剛才才找到的奇怪石頭對吧？」方璇一邊說著一邊指了指鄭烈腳邊老舊的大提袋，那是鄭烈撿垃圾專用的袋子。「咦？你怎麼知道？」鄭烈驚訝地說。「不對，鄭烈你撿垃圾看袋子就知道，另外你也常常撿石頭，所以也不算太難猜。」邢泰冷靜的分析著。「但是——你沒撿過有晶片在裡面的石頭吧？」方璇頭抬得老高，用下巴指著鄭烈，跩跩的說。「咦？這你都知道？」", "鄭烈吃了一驚，並從袋子裡拿出剛撿到的奇怪石頭。「哪尼？」「居然！」「欸欸欸真假啊？」眾人紛紛驚呼。「這下知道我說的是真的了吧！」方璇擺出勝利的姿勢，並順勢轉了一圈。在眾人終於開始相信方璇說的神奇經歷後，方璇才把「今天」後續所發生的事情也講了一遍，說到看見的未來時，不禁哽咽，此時平常北爛的魏元祖跟鍾瑞基也難得的正經了起來。‌「因為我相信我所看到的是真實的未來，所以", "如果有方法的話，我希望能夠改變它⋯⋯」方璇接過鍾瑞基遞來的衛生紙，擦了擦眼角的淚後，說：「而這也是我請助教過來的理由。」"
        ],
        "next": ["/decision"]
    },
    "9WJZRXMIER": {
        "progress_num": 13,
        "name": "13 暴風雨",
        "story": [
            "方璇向大家解釋了關於神秘人所說，世界是一個遞迴程式、當前節點注定毀滅、導致這一原因的上層節點、以及方璇所想的拯救未來計畫。「有沒有一種可能，我們可以回溯到大事件的節點，去改變它的結果，讓 3 個分支變成 2 個分支，這樣就不會再走到我所看見的那種悲慘結局了。」方璇說到這，語氣充滿希望，但對比之下社長鄭烈的臉色卻沉了下去。「那這樣不就等於要消除掉我們這個世界嗎？」鄭烈說。", "「嗯⋯⋯就結論來說是，但是這樣才能避免悲慘的未來啊！」方璇努力的辯解。「現在是現在，未來是未來，就算最後是悲慘的結局，難道現在就沒有價值嗎？就應該要這樣直接被抹消嗎？」「但是其他的分支也會有我們，也會有神科研，而且還不會遇見悲慘的未來！」鄭烈搖了搖頭，對著方璇發出靈魂拷問：「難道你覺得就算世界不同、背景不同、經歷過的都不同，只要叫同一個名字、長相同的模樣，", "就是同一個人嗎？」"
        ],
        "next": ["96UKH2O8H3", "96UKH2O8H3"]
    },
    "96UKH2O8H3": {
        "progress_num": 13.1,
        "name": "13-1 美好的未來",
        "story": [
            "「況且你憑什麼這麼相信那個神祕人說的注定毀滅？也許世界真的是個遞迴好了，你也確實重複經歷了 3 次今天，但是你看你今天的行動不同，不是就已經造成分歧了嗎？」被鄭烈這麼一問，方璇一時之間無言以對，至今為止發生的事情太過離奇，其實自己也沒有靜下心來好好思考過這一切，確實，自己今天的行動已經讓事情與「昨天」的發展有所不同了，會不會其實世界並不真的注定毀滅呢？又或者，會不會", "明天早上醒來，發現這一切不過是自己的夢呢？鄭烈又接著說「更何況，比起那些不知道真實性的未來，把握現在不是更重要嗎？」鄭烈用誠懇的語氣說道：「你說要拯救未來，卻要犧牲現在和我們大家的一切嗎？」被鄭烈連續的詰問問倒，方璇低下了頭、陷入迷茫，整個社辦陷入沉默。她已經搞不懂，之前所看見的未來到底會不會發生，既然一切是注定的，那又為何要讓她知道這些、為何又要讓自己有改變", "的機會？這幾天一直為了這種不確定的事情想破頭，真的已經太累了，要不乾脆就什麼都不要想，專注地活在當下就好呢？片刻過後——「好吧，我想你說的也有道理，這一切實在是離奇了，是我太一股腦的相信了。就像你說的，或許世界並不注定毀滅，又或許我根本只是做了一場夢，就像全面啟動那樣⋯⋯」見方璇的態度軟化下來，鄭烈也緩和了語氣，給了方璇個台階。「沒事啦，說不定你是在程設課", "睡著結果做惡夢了。」「沒想到方璇這樣的正經人也會跟魏元祖一樣耍中二呢，哈哈哈！」鍾瑞基趕忙出來打圓場，一邊用手肘推了推恍神的魏元祖：「欸中二代表，說話啊！」「嗯？啊⋯⋯喔！」「哼！看來你終於被我的氣場給影響，覺醒了心中的黑暗啊！」魏元祖一回過神，馬上轉換成中二模式，配合鍾瑞基活絡氣氛，眾人也都鬨笑起來，社辦內外充滿了快活的空氣。「哈哈⋯⋯」方璇乾笑了兩聲，雖然", "心裡仍然覺得有什麼，但方璇認為鄭烈說的有道理，把握當下或許才是對的，並且，比起世界毀滅，她更願意相信未來是美好的——"
        ],
        "ending": "結局 2 - 珍視眼前的美好，相信你所相信的未來",
        "next": ["GWRUS70M0O"]
    },
    "GWRUS70M0O": {
        "progress_num": 13.2,
        "name": "13-2 悲慘的未來",
        "story": [
            "儘管一時間被鄭烈的連續提問給問倒，但方璇依舊堅持應該回溯到大事件的節點，直接從根源避免悲劇的未來。「雖然你現在說得好像無所畏懼，但那是因為你沒有親眼看到那些殘酷的未來，先不管世界怎麼樣，你我身邊的所有人都是在悲傷和絕望中滅，難道你可以接受這樣的未來嗎？」方璇激動的說。「方璇。」鄭烈長長的吐出一口氣後，用無比認真的眼神看著方璇說：「我跟邢泰創立這個社團，", "最初是想用科學來解釋各種奇怪的現象，意思是，我們相信世界並不神秘，一切都有其原理。」「那你又要怎麼解釋我能講出不擅長的程設課的內容，或者知道你撿的石頭這些事情？」方璇反問。「等一下，你先別急著回嘴⋯⋯」鄭烈打方璇的辯解，繼續說：「我並不是想說你在說謊，我相信在座的每一位都是相信你的，但是，這樣奇的事情發生時，我們是不是應該先不要衝動，我們應該——」鄭烈說到", "這，看向社內文學造詣最好的副社邢泰。「大膽假設，小心求證。」邢泰回答道。「胡適說的。」鍾瑞基馬上補充道。「是的，就這句話，我們是否有足夠多的證據能證明你說的事情是普遍存在的一種現象，以及我們是否能通過各種手段去驗證它，這才是要說的。我們對這件事的理解知之甚少，要站在這麼孱弱的基礎上去行動，實在不能說服我。」「我只是不想看到我的家人、還有你們一個個都經歷那些", "痛苦而已！你們不相信就算了，這件事情我會自己想辦法解決！」方璇眼見沒法說家，索性就不說了，直接奪門而出。看著方璇氣鼓鼓的消失在走廊盡頭，鄭烈站在社辦門口深深地嘆了口氣。回到社辦內，大家面面相覷，一時之間也沒有什麼想法，方璇平常個溫和的人，跟誰都能相處得很好，也從沒有認真生氣過。而且作為社唯一的女生，自然是社團的社寵，大家總是讓著她，更別說這樣激烈的爭執，那", "是從來都沒有過。但這次不一樣，大家看得出來她並不是在開玩笑。沉默了片刻後，站在角落一直沒有說話的韓術終於開口了：「各位，我有一個想法——」"
        ],
        "next": ["/snake"]
    },
    "4282RE7VPB": {
        "progress_num": 14,
        "name": "14 升起的黑暗",
        "story": [
            "方璇離開社辦後，在公車站的椅子冷靜了一下後，便決定獨自前往「昨天」——或者說「上一個今天」發現的那個神奇的地方。「你又來做什麼？」這次神秘人早早就現身了。「我要回溯到上層節點，去改變致使一切只能走向毀滅的那個事件。」方璇有點生氣的說。神秘人搖了搖頭，眼看他伸手往方璇虛抓一下便又要故技重施，而就在此時，神科研的成員們衝了出來攔腰抱住神秘人和方璇，並順勢往前衝進", "黑暗。這次，全部的人都掉進了那個黑暗空間。「你們⋯⋯怎麼來了？」方璇爬起來時驚訝的問道。「由你之前的敘述來看，要突破障礙必須要有大量 data 短時間內塞入這個記憶體空間，才有辦法造成溢位，因此我推斷憑你一個人是無法再次進入記憶體空間的。」韓術說「而我們這些人，或許該說我們這些物件，就是最大的 data。」「就像鄭烈說的，我們沒有不相信你，只是這種過分離奇的事情，是需要", "一點時間消化的。」邢泰一邊幫忙扶起魏元祖，一邊說道。「陪社長來的啦！」鍾瑞基滿臉賊笑的看向鄭烈。「什⋯⋯什麼叫陪我來的，大家不是聽了助教的話才來的嗎？」鄭烈似乎讀懂了他的話中有話，神色緊張地掃視眾人。「我彷彿嗅到一股戀愛的酸臭味呀瑞基，你說，這股味道是從哪兒飄來的呢？」魏元祖怪腔怪調的附和著鍾瑞基。「什麼啊？酸臭味？我沒聞到啊！」方璇歪著頭問。「兄弟，我就幫你", "到這了。」邢泰一手拍在鄭烈的肩膀上說道：「學學魏元祖的忍道吧。」「我一向都是有話直說的！因為這就是我的忍道！」魏元祖聽到關鍵字，馬上發病大吼出來。「媽啦！邢泰你什麼時候也學會講忍道這種詞的？」鄭烈激動的甩開邢泰的手，語氣誇張的像是企圖隱瞞什麼。「你們到底在說什麼啦？」方璇問道。「鄭烈，作為你的兄弟，你不說，我就替你說了。」邢泰對著鄭烈說完，便轉過身去，對著", "方璇說：「方璇，其實鄭烈他⋯⋯」「社長他媽臭傲嬌啦！就他最擔心你，所以一聽助教講完他的看法，馬上說要大家一起來找你，怕你出什麼事啦！」鍾瑞基強行打斷了邢泰的暴雷，並在背後對鄭烈比出手勢：我・罩・你；而鄭烈也用手勢比回去：真・兄・弟，比完順勢捶了邢泰一拳。「好了！大家別鬧了，好好看看周圍，現在已經進入不得了的地方了，皮繃緊一點，還在嘻嘻哈哈，太誇張", "了！」鄭烈重新打起精神來，把大家的注意導回了正軌。經過鄭烈的這麼一提醒，眾人都收起了原本的笑臉，彼此靠攏的同時警戒的觀察著四周。「這就是記憶體碎片嗎⋯⋯」韓術好奇的伸出手觸碰了其中一個漂浮的光球，一瞬間，大量的資訊灌入韓術的腦袋，讓韓術整個人怔在原地。「學長！你還好嗎？」邢泰見狀趕忙上前確認韓術的狀況。「他沒事啦，只是看見了其他節點的記憶而已。」方璇解釋道：", "「你們也可以碰碰看，你們就會知道我說的那些是怎麼一回事了。」眾人聽聞，便紛紛觸碰了漂浮在空中的各種記憶體碎片。「雖然本來就信了方璇說的，但親身體驗一次，那還真不是三言兩語能輕易描述的呢⋯⋯」片刻後，鄭烈伏在地上，大口喘著氣說道。「你看見了什麼？」方璇詢問。「不確定是多遠的未來，但那世界無比荒涼，你我所熟知的一切皆不復存在，僅僅是這樣窺探，就感覺沉重的喘不過氣來", "了。」鄭烈爬了起來說道：「我覺得我能理解你想拯救世界的心情了，雖然具體的做法我還是不能完全理解。」眾人在看完不同的記憶體碎片後，表情都明顯凝重了起來，全然不見方才進入記憶體空間時的快活氣氛。同時，他們也注意到了另一件事情——神秘人的身影出現在眾人身後，最先察覺到的是社團內的運動健將——邢泰，他將大家護在自己身後，警戒的看著神秘人。「你怎麼也跑來這裡了？」鄭烈走上", "前，站到邢泰身邊，出聲與神秘人對峙。「照理來說不可能啊！如果像方璇說的那樣，這位是『Caller』，那麼他應該要待在 Call Stack 才對⋯⋯」韓術一手抱胸、一手托著下巴，喃喃自語道。「媽媽咪呀！這個人陰魂不散的，比富江還要恐怖。」魏元祖明顯嚇呆了。「拜你們所賜，我也跟著你們一起被系統判定成溢位錯誤了，這樣我呼叫的節點都無法回傳結果。唉⋯⋯不如我換個方式說吧——」神秘人語氣", "略帶指責，表情有些微妙。「你們原本所處的世界已經消失了。這就是你們想要的結局嗎？人類的情感真是難以理解⋯⋯」「想跟身邊重要的人一起活下去的心情，身為程式的你怎麼會懂？」方璇嚴厲地反駁神秘人的論點。「對啊！可別小看我們神科研的羈絆！我們團結起來是連程式溢位都能辦到的。」鄭烈一邊吐出了熱血的字句，一邊將眼神瞥向後方的夥伴們。「無法理解。你明明說過想阻止毀滅的未來，但", "說到底，人類這個個體都是自私的，如果那個未來裡面沒有你摯愛的人們、沒有值得你留戀的人事物，你還會做出這個選擇嗎？」「根據馬斯洛需求理論，任何生物都會優先滿足自己的生理需求，從這點上就可以證實任何生物都是自私的個體。人類與其他生物的差別在於：我們有愛與歸屬需求，我們有自我實現需求。」鍾瑞基推了一下眼鏡。「一切都是命運石之門的選擇。」魏元祖想學鍾瑞基推", "眼鏡，但他用左手食指抹了一下自己鼻樑的位置，意識到自己沒有戴眼鏡後，便尷尬的將手放下。「沒錯！對於這個世界來說，我們就是『變數』！」方璇朝神秘人喊到，其他人都被帶動了情緒，紛紛呼聲叫好。「那麼⋯⋯」嘶啞的聲音從神秘人的方向傳來，但說話的源頭並不是神秘人。在他身後，有一道黑色影子升起、並逐漸壯大。影子最終化為球狀物質，似一顆虛實交錯的行星。球體的中央坍塌成", "一個深邃的口子，彷彿要把人吞入一般。其中長有幾排尖齒，影子齜牙裂嘴、詭異地笑著，像是在嘲笑著人類的愚蠢。在影子頂端長出了幾支若隱若現的粗大胳膊，它們全都纏繞在一起，如同扭曲打結的繩子，在空中肆意地擺動、揮舞著。「是時候交還你們的一切了，可悲又可憎的螻蟻——」"
        ],
        "next": ["/handouts"]
    },
    "ZRBP2RE9HW": {
        "progress_num": 15,
        "name": "15 混沌",
        "story": [
            "那頭巨大黑影對著不存在的天空仰天長嘯，這聲叫喚如此淒厲，幾乎要貫穿眾人的耳膜，那聲音彷彿喚醒了人類最原始本能的恐懼，眾人皆因此而愣在原地。直到尖嘯聲散去，黑影開始朝眾人的方向衝過去。「跑！」社長的一聲大呼，把大家喚醒了過來，並馬上跟著鄭烈開始狂奔，試圖遠離那個不可名狀的未知生物。「方璇！你打算怎麼做？」鄭烈一邊跑一邊問方璇，並不時回頭觀察那個異樣的生物。「我我", "我⋯⋯我本來是想說大家一起去尋找之前大事件的節點然後一起進去⋯⋯然後⋯⋯」方璇慌張地說，由於背後追擊大家的生物實在過於恐怖，導致方璇講話都結巴了起來。「重點：先找節點。」邢泰打斷了方璇，迅速的總結，並點出當前最優先的事項。「那就這麼辦。」鄭烈和邢泰對視後點了點頭，隨即對著跑在後頭的成員喊道：「各位！我們現在開始分頭尋找方璇說的『大事件節點』！但是同時也要", "注意後面的怪物！」鄭烈喊話的同時，注意到那個怪物沒有追上來，於是便停下了腳步。「神秘人被那移動深淵吞噬了！」魏元祖發現回頭張望著的社長，便向他解釋。鄭烈這時才注意到神秘人並沒有跟上來。「那個神秘人完全沒有要跑的意思，就直接站在那裡，然後就被吃了。雖然不清楚那東西到底是什麼，就算是程式也會滿足自己的生理需求嗎？難道說程式其實也是一種生物？」即使在這種情況下，", "鍾瑞基也依然喋喋不休。「那好，現在也不是能憐憫他人的情況，這是一個很好的機會，我們就照剛才說的，分頭行動、注意怪物，散！」鄭烈迅速的下達指示，神科研的成員們也馬上四散，開始憑著方才各自看到的記憶，尋找大事件的節點。「你知道我其實是超高校級幸運嗎？搞不好就是這個了！」魏元祖一邊對鍾瑞基說到，一邊趴上面前巨大的球體，鍾瑞基回頭觀望了一下怪物的動向後，便轉身往比較", "近的另一個巨大球體過去了。鄭烈和邢泰用驚人的判斷力在極短的時間內判斷是否是要尋找的節點，一發現不是便從球體上彈射起飛，然後奔向別的球體。方璇也用最快的速度在不同的球體之間穿梭著，反倒是韓術，雖然並非閑庭信步，但也沒有像其他人那樣狂奔，而是拿著筆記本寫著什麼，嘴上不停的念念有詞，走到球體前，也沒有急著把臉埋上去，而是在筆記本上核對著什麼。在一陣短暫的騷亂過後，眼", "看黑色巨物已經幾乎將神秘人吞噬殆盡，神科研眾人的搜索卻依舊沒有進展，他們像無頭蒼蠅一般，在無數個球體之間來回穿梭著。巨怪將神秘人吃乾抹淨後，用扭曲的胳膊拍了拍自己口器下方的「肚子」，似乎還未滿足，便張開自己猶如深淵般的血盆大口，朝眾人俯衝。「節點在這裡！大家快點過來！」韓術站在一顆球體前面，揮舞著雙手招呼著大家，手上還抓著方才不停書寫的筆記本。在附近的方璇注意", "到韓術筆記本上的潦草字跡——與其說潦草，不如說上面密密麻麻的寫著混合數字與符號的計算式，還有各種樹狀圖，方璇不禁心理一驚：難道助教是用算的算出節點位置的嗎？眾人在腎上腺素的推動下，健步如飛，然而，後方的深淵也並非等閒之輩，死命地追逐著跑在最後的魏元祖，他跑過的地上滿是流出的汗水，就好比一輛灑水車。而這輛灑水車的速度遠不及怪物，眼看魏元祖即將被黑暗給追上——「欸！", "鍾瑞基！你知道男人什麼時候最帥嗎？」魏元祖似乎到達了極限，他開始放慢了腳步，一邊喘著粗氣，一邊向前方只差一個身位的鍾瑞基說。「殺小啦幹！死胖子快點跑！他媽不要在這時候講幹話！」鍾瑞基沒好氣地吼回去。「哼哼，男人最帥的時候，就是燃燒生命拯救夥伴的時候，就像千人之律者之戰的尾聲，姬子最終用自己的生命做出了對他來說最正確的選擇！我要突破系統限制啦！」魏元祖大吼，接著", "便用盡全身的力氣追上在自己前面的鍾瑞基，並且用自己充滿彈性的肚子撞飛鍾瑞基，讓他一下子就趕上跑在前面的人們。「琪亞娜，只要你相信……我就會化作星星，在夜空中守護著你。就算火炬會熄滅，月亮會失去光芒；這不變的微光，也會為你點亮前行的方向。」這一撞讓魏元祖耗盡體力、趴在地上喘不過氣來，在被黑暗吞噬的前一刻，他奮力的向前面的社團成員們豎起大拇指，然後仰天長嘯——", "「凡人阿！爾等應當銘記！吾乃漆黑之元祖，魏元祖大人！」眾人見狀，皆被魏元祖的舉動所震撼，本來已經快到達節點前的方璇，當即轉過身衝向魏元祖，而鍾瑞基爬起身後也馬上回頭，但都被邢泰給拉住了。「不行！」邢泰嚴肅的對著兩人搖了搖頭，並拖著兩人繼續往前跑向節點，轉身之前，鄭重的向魏元祖點了點頭，而鄭烈則是頭也不回的朝後方豎起大拇指。站在節點前的韓術，卻眼神銳利的看著魏元祖", "和後方的龐然大物。魏元祖在看到大家的反應後，勉強翻過身來、仰面躺著，用最後一口氣說道：「幹他媽的，我根本超帥！」由於魏元祖的犧牲，替眾人爭取到了一點時間，但令大家萬萬沒想到的是，魏元祖被吞噬的速度之快，幾秒鐘後，怪物又開始了它的獵殺。「媽呀！這東西也太快了吧？」跑在最後的鍾瑞基從原本經歷夥伴消逝的悲傷情緒又變回了恐懼：「雖然不知道被吞噬後會去到哪裡，但我的", "直覺告訴我被吞了就全完了！」終於大家在節點前集合了，鄭烈著急的詢問方璇：「接下來呢？」而方璇依舊為魏元祖的離開而啜泣著。「方璇！」鄭烈稍微提高了音量，並兩手抓住方璇的肩膀，像是要把方璇叫醒一樣：「元祖把希望託付給你了，現在不是哭的時候！」方璇被鄭烈這麼一晃，也清醒了過來：「接下來我們要想辦法進入這個節點，然後阻止那扇門被推開。」「學長，有辦法進去", "嗎？」得到答案後，鄭烈又馬上轉頭向韓術詢問。「目前還沒想到辦法，應該不能用常規的方式進去，由內而外可以靠溢位，由外而內就需要系統級別的權限了。」韓術說道。「用打的呢？」鍾瑞基邊說邊撞了上去，但卻沒有效果。「各位注意！怪物來了！」一直警戒著遠方的邢泰大喊了一聲。「繞著這個節點打轉、盡量不要遠離，並同時觀察和思考進去的方法。散！」鄭烈再次快速的下達指示，眾人便", "圍著節點四處逃竄。"
        ],
        "next": ["/maze"]
    },
    "OZWLKG0JE3": {
        "progress_num": 16,
        "name": "16 閃耀著光芒",
        "story": [
            "「我想通了！這個玩意兒是所謂的 GC，我們現在缺少的操作權限就是它！」韓術忽然靈光一閃，大喊道：「社長！引誘怪物攻擊節點！」「引誘怪物攻擊節點！」鄭烈隨即仰天大吼，將資訊複述給所有社員。方璇馬上從背包裡拿出各種隨身物品，朝怪物丟去，吸引怪物的注意，而怪物也馬上朝著方璇襲擊過來。「完了完了完了⋯⋯我還沒想好怎樣讓它攻擊啊！」方璇一邊閃躲一邊碎念著。說時遲那時快，", "方璇的一支手被怪物給抓住，正當怪物張開吞天巨口要將方璇吞下時，又有一些雜物飛了過來，打中怪物。「操你媽什麼機掰破爛克蘇魯！」鍾瑞基一邊大聲咒罵，一邊不停地朝怪物丟東西。「鄭烈！把石頭給我！」眼見書包裡的雜物丟完了，鍾瑞基轉頭向鄭烈大喊，而鄭烈也把破舊的大提袋扔給了鍾瑞基。「他媽給我放開！」抓起鄭烈的大提袋後，鍾瑞基把提袋揮舞的像是流星錘一樣，衝向怪物，並一把砸", "在抓住方璇的觸手上，觸手在受擊之後，變成了一些 0 跟 1 飄散在空中。「快跑！」眼見方璇脫困，鍾瑞基一把推開方璇，甩著提袋又衝上前去：「幹你娘原來被打還會受傷，我還以為你是什麼無敵的存在，把我兄弟還來！」「瑞基不要衝動！」鄭烈用至今為止最大的音量吼了出來，但已經來不及了，怪物甩出更多的觸手，從四面八方把鍾瑞基給纏住，並一口吞了下去。「不要！」方璇哭著叫出了聲，", "邢泰也懊惱的一拳捶在節點的牆上。不給任何哀悼和喘息的機會，怪物吞下鍾瑞基後，又馬上向著大家襲來。「社長、副社！我有話說！過來！」情況緊急，也顧不得禮貌，韓術直接對著兩人大喊。兩人立刻集合到韓術的身邊，韓術用極快的語速說了幾句話後，把自己的筆記本和筆鄭重地交給鄭烈後說：「我很高興認識你們！希望別的節點的我能更早認識你們並加入社團！」韓術用雙手握住鄭烈的手，並轉過", "頭對邢泰點了點頭，露出一抹淺淺的微笑，那抹微笑也許是悲傷、也許是惋惜，又或者是無奈。「學長⋯⋯」邢泰面色凝重，似乎是感受到了對方的情緒，想說點什麼，但話到了咽喉處又被吞了回去，只是點了點頭。韓術把整個書包丟向怪物，吸引了怪物的注意，之後便兩手各抓著鄭烈和邢泰用衣服、皮帶背包等雜物編成的繩子。「就是現在，拉！」眼看怪物即將伸出觸手，韓術朝著剩下的人大喊。", "鄭烈和邢泰同時向兩邊拉，使得韓術緊緊貼在節點的外殼上，怪物伸出觸手，沒能拉動韓術，便將整個身軀靠了過來。「哈！我就知道，你的觸手力量果然不足，才會被打一下就消散。要抓住學弟也要用那麼多手，就跟我想的一樣！」韓術張狂的笑著，此時的他如同瘋狂科學家那般挑釁著：「來吧，把我連同這堵牆一起吞噬吧！」那瞬間，怪物一口咬下，連同韓術、與他背後節點的部分外殼。「成功了！」", "鄭烈喊了出聲，但內心十分複雜：「謝謝學長！進入節點後我會找到我自己，並讓他去找你的！」鄭烈暗自在心中下定了決心。鄭烈和邢泰兩兄弟繞開了怪物，前去查看方才被怪物咬下的洞口。「怎麼樣了？」方璇也趕了過來，卻見兩人的面色十分凝重。「洞⋯⋯不夠深，還沒穿過外殼。」鄭烈臉色鐵青地盯著節點，眼裡寫滿了絕望。「那接下來應該怎麼辦⋯⋯」方璇頹然坐倒在地上。「我來吧。」鄭烈閉", "上了雙眼，深吸了一口氣，準備再次行動。「不行！」邢泰中斷施法。「那不然怎麼辦？難道你要叫方璇去嗎？」鄭烈有些激動的質問著。「我不是那個意思！」邢泰也激動的說：「讓我想想！」邢泰難得露出了焦躁的神情，三人此刻都沉默了下來，各自都在腦內風暴。「不然⋯⋯我來⋯⋯」方璇小聲地說道。「不——」邢泰正要阻止，卻被方璇打斷。「你聽我說，我負責引誘怪物攻擊，你跟鄭烈在我被", "抓住的時候像瑞基那樣打斷觸手，這樣他就要把身體再往前，而我也可以趁機逃脫了。」鄭烈和邢泰對視了一眼，兩人很有默契的彼此點了點頭。「嗯。」「好吧，就這麼辦！」但兩人起身時，邢泰悄悄的在鄭烈耳邊說了什麼。「——如果不成功的話，兄弟，你要好好照顧方璇，要相信你們的未來。」邢泰和鄭烈抱了抱，隨即便展開了行動。三人再次吸引怪物的注意，這次由方璇站在洞口前，而鄭烈在一", "旁待命著。「邢泰呢？」方璇發現邢泰不在，慌張地問鄭烈。「別擔心，他有他自己的計畫。」鄭烈安撫著方璇。此時怪物已經向方璇伸出觸手將她抓住，正當怪物張開嘴時，怪物的後方發出一聲爆喝——「殺！」與此同時，鄭烈也用最快的速度打斷所有抓住方璇的觸手，並一把抱起方璇，往旁邊衝去。原來邢泰偷溜到了怪物的後面，想趁著怪物張開口時，一腳將怪物往前踢，讓怪物直接撞上節點，但", "或許是連續的奔波，加上失去夥伴的悲傷，讓一向冷靜的邢泰草率了。怪物被邢泰一踢，雖然確實往前移動了一點，但怪物身上隨即又伸出大量的觸手，將邢泰給抓住。原本在怪物正面的巨口坍縮了下去，並從背面張開，此時無論邢泰怎麼掙扎也掙脫不了。鄭烈剛放下方璇，準備朝邢泰跑過去時，卻已為時已晚。「可惡啊！」鄭烈對著天空大吼，方璇感到無比自責，卻又不知道該如何是好，剩下來的兩人", "只能無助的看著彼此。眼見怪物又開始騷動，鄭烈慌亂的拾起韓術留下的筆記本和筆，並拉起方璇繼續逃跑。「大膽假設，大膽求證！」鄭烈翻開了筆記本，就看到韓術寫的幾個大字。「哈！這什麼莫名其妙的名言佳句啦⋯⋯」鄭烈不禁苦笑一聲，想必此刻他的心裡是五味雜陳。兩人藏進了幾個節點之間的縫隙，心想著怪物龐大的身軀要找到這裡還需要一點時間，鄭烈和方璇便趁機喘幾口氣，並思考著接下", "來該如何應對。鄭烈又翻著韓術留下的筆記本，這時發現了一頁摺起來的部分，外面寫著「給社長」。「我希望你用不到這段話的內容，但如果你需要，希望能給你們帶來幫助。一般程式在設計資料結構時會設計邊界，用來避免溢位，換句話說，節點的殼會有雙層，就算我的那一下沒有完全打破，至少也能破開外面那層，也就是說，現在有了支撐點，不需要有人拉繩子了，另外，怪物吃到節點的外殼時應該", "會停止動作好一陣子，你們會有足夠時間鑽進節點，至於原理⋯⋯你就去問問其它節點的我吧！最後，雖然很慚愧，但祝你好運。」「哈⋯⋯哈哈⋯⋯靠邀啊學長，你是神仙吧？」鄭烈不禁為韓術的智慧所折服。感嘆的同時，也在筆記本上寫了些字，並將那頁撕了下來、摺好，小心翼翼的安放在自己的手心。「It's show time！」鄭烈站起身，捶了捶自己的胸口，這是他下定決心時經常會做的動作。", "活動了一下筋骨並對方璇伸出手，說：「走吧！學長給我們留了個好方法。」看著充滿自信的鄭烈，方璇心中似乎又燃起了希望。鄭烈拉著方璇跑到目標節點附近，並囑咐方璇躲好，等怪物一攻擊，馬上趁亂鑽進破口。「我會先鑽進去啦！你到時候趕快進來就是了。」鄭烈拍了拍方璇抓著他衣角的手，感受到方璇手掌的冰冷，便把自己厚實的手掌按在方璇的頭上晃了晃，試圖安撫方璇，又趁機輕輕吻了一下", "蓋在方璇頭上的自己的手背，然後用氣音喃喃道：「再見。」「對了，這個——」鄭烈拿出了韓術留下的筆記本和筆，以及自己撕下來的紙條。「筆記本我幫你放書包裡，這張紙，你進去後再打開。」說完便將紙條塞進方璇手中握好，隨後便向破口走去。「風蕭蕭兮易水寒，壯士一去兮不復還！」鄭烈站在洞口前大喊，馬上就引來了怪物的注意，並迅速向他靠近。「方璇！準備！」「好！」怪物張開巨口", "時，方璇做好起跑準備，蓄勢待發——"
        ],
        "next": ["/pov"]
    },
    "95MMFJ8EDE": {
        "progress_num": 17,
        "name": "17 獨自一人的任務",
        "story": [
            "方璇爬進了節點，與記憶體黑暗的空間不同，這裡是個陽光和煦的大白天，前方的光線讓方璇有些畏光。「你這個大騙子⋯⋯」方璇望著剛鑽進來的破口，雙手抱著膝蓋、蹲在原地，然後將頭埋在雙膝中，不停掉眼淚，方才的變故讓她一時之間還難以接受。不知過了多久，方璇才抬起頭來，似乎想起了什麼，便擦了擦臉頰上的淚痕。攤開自己手中一直握著的，鄭烈最後塞給他的紙片，上面用潦草的字跡寫著：", "「即使命運被安排好了，即使這個世界是虛擬的，那些刻在自己內心深處的信念，你所經歷的一切、你的邂逅、你的領悟、和你的成長，這些價值卻不是任何人所能動搖的，它們也不是被某人給創造出來的。如果你所感受到的情緒是真的，千萬不要忘了自己的信念。」看見這些文字，伴隨著極其強烈的愧疚感和孤獨感襲來，方璇視線又變得模糊，但她只是抬起頭，讓淚水流回眼眶、深呼吸、學著鄭烈那樣捶了", "捶自己的胸口，把紙片摺好，放進平常戴著的學生證套。這才站了起來，環顧四周，確認自己所在的位置。「這裡是⋯⋯」方璇左看右看，只知道自己隻身在樹林之中，幾道大小不一的光斑透過樹葉撒下，地上的碎石子與枯葉形成一條向上的蜿蜒道路，像是有人踏足過的痕跡。方璇循著前人的步伐，石徑雖然崎嶇，登高愈遠，樹木愈漸稀疏，直到看見近在咫尺的山頂，陡峭的坡度讓方璇愈發氣喘。四下無人，唯", "有蟲鳴鳥叫與雜草叢生體現出生機，就好像來到一座荒蕪的叢林都市。這時，方璇想起神秘人說過的話：「你們原本所處的世界已經消失了。這就是你們想要的結局嗎？」一切都來得太快，到頭來，甚至對時間的概念也已經紊亂不堪。方璇不禁反思，直到現在為止，為了阻止大事件發生，失去身邊的羈絆，然後到一個完全陌生的地方，難道她的選擇都是錯的嗎？正思考著，方璇已經爬上了山坡頂，一看四周，", "沒想到竟然是學校的射箭場，原來自己剛才所在的地方是射箭場到桃米中間的山坡。終於爬到了平坦的地方，方璇累得直接躺在草地上喘著氣，一手蓋在眼上遮擋刺眼的陽光，一邊聽著自己的心跳聲，忍不住又想起社團的大家，不覺眼眶又濕潤了起來。九月，埔里的天空很藍，是否有一片雲朵為方璇哭泣，沒有人知道。而看著遙遠的天際線，那裡似乎還有著什麼至關重要的事情等著她去完成。「絕對要阻止那", "扇門被推開⋯⋯」想起自己來到這裡的目標，她才終於重新振作了起來。都已經走到這一步，說什麼也無法回頭了。於是收拾起悲傷的情緒，決定先從自己能做的開始做起。「總之，先想辦法接近目標吧！」憑著從記憶體碎片中所見，方璇已經得知了目標的系級，於是她便在科院門口附近躲藏起來，等待目標出現。四天後，傍晚——一名男子獨自從科院走出來，方璇終於等到了一個完美時機，急忙從草叢中爬出", "來。「嘿⋯⋯」話音未落，方璇只覺得眼前一黑，就這樣失去意識了。不知過了多久——「這裡是⋯⋯？」方璇緩緩睜開眼睛，映入眼簾的是陌生的天花板。「啊！你醒了，我去請醫生過來！」在一旁的護理師看到方璇睜開了眼睛，急忙說道。方璇勉強撐起身子、環顧四周。看著周遭的一切，方璇意識到自己現在在醫院，但是怎麼來的她卻沒有印象，只記得她正要叫住李俊逸，然後就在這裡醒來了。", "「小姐妳好，我是陳醫生，目前負責妳的醫護工作，為了檢查，能請妳回答我幾個問題嗎？」一名醫生走了過來，並坐在方璇旁邊的小椅子上，手上拿著寫字板，向方璇問道。尚未從恍神中恢復，方璇只是點了點頭。「請問妳的名字叫？」醫生問道。「方璇。」「妳的身分證字號？」「E278113566」「那妳的生日是？」「4 月 22 日。」「幾年呢？」「20⋯⋯2000 年。」方璇臨時捏造了自己的出", "生年，畢竟對於這個節點的時間來說，自己是未來人。「好的，基本狀況沒問題。」醫生做完簡單的詢問後，向護理師拿了另一份文件：「抽血報告顯示妳營養失衡、血糖過低，還有肝指數 GPT 過高，嗯⋯⋯簡單來說就是妳過度飢餓，加上過勞，所以才會昏倒。」醫生一邊看著文件一邊說。「吃飯、睡覺這些都是基本，請記得要照顧好自己的身體。妳現在還有哪裡不舒服嗎？」「稍微有點頭暈。」方璇", "閉上眼輕輕轉了一下頭，感覺一陣暈眩。「OK，那你再躺一下子，過一段時間再來檢查你的狀況。」醫生將文件交還給護理師，站起身對方璇說道，接著便跟護理師轉身去處理別的病患了。醫生和護理師都走了之後，李俊逸走了過來。「同學妳好。」李俊逸用略帶尷尬的語氣打了招呼。「啊！是你送我來的⋯⋯謝謝。」方璇突然間也不知道該怎麼面對這尷尬的場面。「其實是叫了救護車啦，哈哈", "實在是太突然了，我都被嚇了一跳。」李俊逸說。「抱歉，本來不該這樣的。」「沒關係啦，但妳本來似乎要跟我說什麼？」「啊！對，請無論如何都要選擇好好活下去！」「呃⋯⋯妳先照顧好自己吧？」「嗯⋯⋯這也不是我自願的⋯⋯」方璇有點不好意思地低下頭，畢竟自己現在的狀況實在是只能用狼狽來形容。兩人頓時沉默了下來。方璇看了看醫院窗外的天空，依舊藍得不可思議，但對她來說也許是暴風", "雨前的寧靜。「總之，過幾天會開始下雨，連續下兩個月，之後會發生一些事，你會遇到重要的抉擇，我明白那會有多麼心痛，我很清楚的⋯⋯」方璇抓著自己的胸口，看起來十分痛苦。「但無論如何拜託你千萬不能選擇放棄！否則⋯⋯否則大家都白白犧牲了⋯⋯」方璇越講越激動，哭了起來。「好好好，妳看起來還有點累，妳先休息一下我去幫妳買點吃的。」李俊逸有些不知所措，他從來都不擅長應付別人哭", "的情況，於是趕緊找了個理由離開，轉身便往醫院裡的便利商店去了。幾分鐘後，李俊逸拿著瑞穗蘋果牛奶跟綜合水果回到方璇的病床前，但李俊逸左看右看，四處找了一圈，始終不見方璇的人影，只在床上找到一張小心折起的紙條。"
        ],
        "next": ["/almost"]
    },
    "CSCZ8DE7K0": {
        "progress_num": 18,
        "name": "18 門扉背後",
        "story": [
            "正如方璇所說，從禮拜天開始下雨，絲毫沒有要停的意思，就這麼一連下了兩個月。隨著時間過去，李俊逸早就把那個髒兮兮的怪女生給忘了，也忘了她說過的話，日子也回到了平常的樣貌。直到有一天，命中注定的意外發生了，在極度悲痛的情況下，李俊逸面臨了許多次的抉擇。而到了最後一次，猶豫了許久，李俊逸終於把手放在了那扇沉重的大門上。當他緩緩推開那扇門時，卻彷彿聽見門後傳來了哭泣聲，", "那哭聲並不激烈，但抽抽搭搭的聲音中，卻能透漏出難以形容的巨大悲傷。李俊逸愣住了，他似乎在哪裡聽過這個哭聲，當時他只覺得莫名其妙，但現在他好像懂了。彷彿被這哭聲感染，李俊逸也覺得眼眶一熱，開始不受控的掉眼淚。從一開始只是掉淚，逐漸哭出了聲音，到最後李俊逸蹲在地上嚎啕大哭。就這麼哭了好久，李俊逸站了起來，抹了抹臉頰。拿出手機想看最後一次思念之人，卻從口袋中一同拉出了", "一張紙片，那張紙片皺巴巴的，想來是被塞在口袋很久了，也不知道是什麼時候放進去的。李俊逸彎下腰來撿起紙片，好奇的打開來看，裡面是用潦草但剛勁的字跡和清秀工整的字跡寫的兩段話——「即使命運被安排好了，即使這個世界是虛擬的，那些刻在自己內心深處的信念，你所經歷的一切、你的邂逅、你的領悟、和你的成長，這些價值卻不是任何人所能動搖的，它們也不是被某人給創造出來的。如果你", "所感受到的情緒是真的，千萬不要忘了自己的信念。」「你愛的人會永遠住在你的心臟，請永遠不要放棄，帶著他活下去。」李俊逸小心翼翼的把紙片摺好，塞入手機殼，他不記得是誰寫了這張紙片給他，但他總覺得是兩個有過相同經歷的人，帶著真誠，用布滿傷痕的手所寫下的，所以值得用心保存。李俊逸離開了原本那扇門，走向了另外一扇，並毅然決然的推開。門後的世界對李俊逸來說是有所缺憾的，雖然", "有些緊張，但李俊逸不會反悔。深吸一口氣，踏入——"
        ],
        "ending": "結局 3 - Lost 2 F□□□ T□□□",
        "next": ["/ending"]
    }
}